src/cf/InformationRegisters/ОценкиКонтрольныхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОценкиКонтрольныхТочек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВероятностиКТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КонтрольнаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОценкиКонтрольныхТочек/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.ЗагрузкаОбработанныхДанныхИзДругойСистемы Тогда
		Возврат;
	КонецЕсли;
		
	ПроверитьНаличиеОценки();
	
КонецПроцедуры		

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеОценки()	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Эл Из ЭтотОбъект Цикл
		
		Период = Эл.Период;
		КонтрольнаяТочка = Эл.КонтрольнаяТочка;
		
		ДатаНачала = НачалоНедели(Период);
		ДатаОкончания = КонецНедели(Период);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОценкиКонтрольныхТочек.Оценка
			|ИЗ
			|	РегистрСведений.ОценкиКонтрольныхТочек КАК ОценкиКонтрольныхТочек
			|ГДЕ
			|	ОценкиКонтрольныхТочек.Период >= &ДатаНачала
			|	И ОценкиКонтрольныхТочек.Период <= &ДатаОкончания
			|	И ОценкиКонтрольныхТочек.КонтрольнаяТочка = &КонтрольнаяТочка";
		
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		Запрос.УстановитьПараметр("КонтрольнаяТочка", КонтрольнаяТочка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ВызватьИсключение НСтр("ru = 'Оценка за эту неделю уже есть.'");
		КонецЕсли;
	
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
